In [1]:
import numpy as np
import pandas as pd

In [24]:
df = pd.read_csv('insurance.csv')

In [25]:
df.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [26]:
df.isnull().sum()

age         0
sex         0
bmi         0
children    0
smoker      0
region      0
charges     0
dtype: int64

In [27]:
from sklearn.preprocessing import LabelEncoder

In [28]:
label_enc = LabelEncoder()

In [29]:
label_enc.fit(df.sex.drop_duplicates())

LabelEncoder()

In [30]:
df.sex = label_enc.transform(df.sex)

In [31]:
label_enc = LabelEncoder()

In [32]:
label_enc.fit(df.region.drop_duplicates())

LabelEncoder()

In [33]:
df.region = label_enc.transform(df.region)

In [36]:
label_enc.fit(df.smoker.drop_duplicates())

LabelEncoder()

In [37]:
df.smoker = label_enc.transform(df.smoker)

In [39]:
df.head()

   age  sex     bmi  children  smoker  region      charges
0   19    0  27.900         0       1       3  16884.92400
1   18    1  33.770         1       0       2   1725.55230
2   28    1  33.000         3       0       2   4449.46200
3   33    1  22.705         0       0       1  21984.47061
4   32    1  28.880         0       0       1   3866.85520